# Taps
tap "anomalyco/tap" # Opencode CLI
tap "aws/tap" # AWS CLI v2
# tap 'homebrew/cask-drivers'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "warrensbox/tap" # Tfswitch

# Binaries
brew "akamai"
brew "ansible"
brew 'awscli'
brew "azcopy"
brew "azure-cli"
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew "cfn-lint"
brew "cloud-sql-proxy"
brew "colima"
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew "git"
brew "git-cliff"
brew "git-lfs"
brew "gitleaks"
brew "goaccess"
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew "nmap"
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# DevOps
brew 'helm'
brew 'minikube'
brew 'kubectl' # kubernetes-cli
brew 'kubectx'
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
# brew 'svgo' # (Requires node)
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.3'
brew "php-code-sniffer"
brew "php-cs-fixer"
brew 'composer'
# brew 'imagemagick'
brew "n"
brew "wget"
brew "wp-cli"
brew "wrk"


# Apps
cask 'adobe-acrobat-reader'
cask 'caffeine'
cask 'dbngin'
# cask 'discord'
cask "ghostty"
cask "github"
cask "google-drive"
cask "google-drive"
cask "handy"
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'iterm2'
cask "keepassxc"
cask "lando"
cask "opencode-desktop"
cask "raycast"
cask 'rectangle'
cask "sequel-pro"
cask "spotify"
cask "sublime-text"
cask 'tableplus'
cask "warrensbox/tap/tfswitch"
cask 'the-unarchiver'
cask 'visual-studio-code'
cask "warp"
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas "Dashlane", id: 517914548
mas "Hotspot Shield", id: 771076721
mas "HP", id: 1474276998
mas "HueAndTheMenu", id: 1534707384
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
