# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-drivers'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'

# Binaries
brew "ansible"
brew 'awscli'
brew "azcopy"
brew "azure-cli"
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew "goaccess"
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew "nmap"
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# DevOps
brew 'minikube'
brew 'kubectl' # kubernetes-cli
brew 'kubectx'
# brew 'hyperkit' # Not available on Apple Silicon

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
# brew 'svgo' # (Requires node)
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'shivammathur/php/php@7.3'
brew "php-code-sniffer"
brew "php-cs-fixer"
brew 'composer'
# brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
# brew 'mysql@5.7'
brew "n"
brew 'nginx'
# brew 'node'
brew 'redis'
brew "wget"
brew "wp-cli"
brew "wrk"
# brew 'yarn'

# Apps
# cask '1password'
cask 'adobe-acrobat-reader'
cask 'caffeine'
cask 'dbngin' # https://dbngin.com/
cask 'discord'
cask 'docker'
cask "dropbox"
# cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask "google-drive"
cask 'gpg-suite'
# cask 'helo'
# cask 'homebrew/cask-drivers/elgato-stream-deck'
cask 'imageoptim'
cask 'iterm2'
cask 'insomnia'
cask "keepassxc"
cask "lando"
cask "libreoffice"
# cask "logitech-options" # Using Logitech Options + Beta (Better with Apple Silicon)
cask "microsoft-teams"
# cask 'pastebot' # https://tapbots.com/pastebot/
cask 'phpmon'
# cask 'phpstorm'
# cask 'ray'
# cask 'screenflow'
cask "sequel-pro"
cask 'slack'
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask 'tableplus'
# cask 'telegram-desktop'
cask 'the-unarchiver'
# cask 'tinkerwell'
cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
cask 'visual-studio-code'
cask "vlc"
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
mas "EchofonLite", id: 403858460
# mas 'Giphy Capture', id: 668208984
mas "Hue in the Menu", id: 1534707384
# mas 'Keynote', id: 409183694
mas 'Meeter', id: 1510445899
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
